---
kind: property
id: P:Autodesk.Revit.DB.Mullion.Lock
source: html/94d4622b-103e-9595-3ef0-2d8679019e8a.htm
---
# Autodesk.Revit.DB.Mullion.Lock Property

Get - to get whether the Mullion line is locked.
 Set - Lock/unlock the Mullion.

## Syntax (C#)
```csharp
public bool Lock { get; set; }
```